{
  "categories": [
    {
      "id": "1",
      "name": "Beef",
      "urlLink": "https://www.themealdb.com/images/category/beef.png",
      "description": "Beef is the culinary name for meat from cattle, particularly skeletal muscle. Humans have been eating beef since prehistoric times.[1] Beef is a source of high-quality protein and essential nutrients.[2]"
    },
    {
      "id": "2",
      "name": "Breakfast",
      "urlLink": "https://www.themealdb.com/images/category/breakfast.png",
      "description": "Breakfast is the first meal of a day. The word in English refers to breaking the fasting period of the previous night. There is a strong likelihood for one or more \"typical\", or \"traditional\", breakfast menus to exist in most places, but their composition varies widely from place to place, and has varied over time, so that globally a very wide range of preparations and ingredients are now associated with breakfast."
    },
    {
      "id": "3",
      "name": "Goat",
      "urlLink": "https://www.themealdb.com/images/category/goat.png",
      "description": "The domestic goat or simply goat (Capra aegagrus hircus) is a subspecies of C. aegagrus domesticated from the wild goat of Southwest Asia and Eastern Europe. The goat is a member of the animal family Bovidae and the subfamily Caprinae, meaning it is closely related to the sheep. There are over 300 distinct breeds of goat. Goats are one of the oldest domesticated species of animal, and have been used for milk, meat, fur and skins across much of the world. Milk from goats is often turned into goat cheese."
    },
    {
      "name": "Katsu chicken curry",
      "urlLink": "https://www.themealdb.com/images/media/meals/vwrpps1503068729.jpg",
      "description": "Katsu curry is just a variation of Japanese curry with a chicken cutlet on top. I used a store-bought block of Japanese curry roux which is commonly used in Japanese households. Chicken Cutlet (Japanese version of chicken schnitzel) brings the Japanese curry up to the next level. It’s so delicious and filling.\n\n",
      "id": "-4i9mXj"
    }
  ]
}